<?xml version="1.0" ?><cherrytree><node name="Configure，Makefile.am, Makefile.in, Makefile文件之间关系" prog_lang="custom-colors" readonly="False" tags="" unique_id="84"><rich_text>    
</rich_text><rich_text scale="h3">                        </rich_text><rich_text>
    </rich_text><rich_text justification="left"></rich_text><rich_text>


 
</rich_text><rich_text scale="h3" weight="heavy">1.autoscan (autoconf): </rich_text><rich_text>
   扫描源代码以搜寻普通的可移植性问题，比如检查编译器，库，头文件等，生成文件configure.scan,它是configure.ac的一个雏形。
    your source files --&gt; [autoscan*] --&gt; [configure.scan] --&gt; configure.ac

</rich_text><rich_text scale="h3" weight="heavy">2.aclocal (automake):</rich_text><rich_text>
  根据已经安装的宏，用户定义宏和acinclude.m4文件中的宏将configure.ac文件所需要的宏集中定义到文件 aclocal.m4中。aclocal是一个perl 脚本程序，它的定义是：“aclocal - create aclocal.m4 by scanning configure.ac”
user input files                       optional input                     process                 output files
================   ==============     =======          ============

                                                        acinclude.m4 -----------------.
                                                                                                   V
                                                                                             .----------.
            configure.ac ----------------------------------------------&gt;|aclocal|

18.  ADD_EXECUTABLE(../bin/bin ${TEST_MATH})
 
19.  #add link library
 
20.  TARGET_LINK_LIBRARIES(../bin/bin ${LIBRARIES})
 
21. 
或者用下面这个CMakeLists.txt 
 1.  #project name
 
2.  PROJECT(test_math)
 
3.  #head file path
 
4.  INCLUDE_DIRECTORIES(
 
5.  include
 
6.  )
 
7.  #source directory
 
8.  AUX_SOURCE_DIRECTORY(src DIR_SRCS)
 
9.  #set environment variable
 
10.  SET(TEST_MATH
 
11.  ${DIR_SRCS}
 
12.  )
 
13.  #add executable file
 
14.  ADD_EXECUTABLE(../bin/bin ${TEST_MATH})
 
15.  #add link library
 
16.  TARGET_LINK_LIBRARIES(../bin/bin m)

  这是一个测试数学函数的程序的CMakeLists.txt，&quot;#&quot;后面为注释的内容，CMake的命令全部为大写 
第2行指定生成的工程名为test_math 
第4行指定头文件目录为include 
第8行指定源文件目录为src，并将其赋值给环境变量DIR_SRCS 
第10行设定环境变量TEST_MATH的值为环境变量DIR_SRCS的值，此处用于显示如何用环境变量对环境变量进行赋值 
第14行将数学函数库赋值给环境变量LIBRARIES，当然，可以不用这个环境变量，而在后面直接使用该库名 
第18行用于指定生成文件，将环境变量TEST_MATH目录下的所有文件编译生成../bin目录下的可执行文件bin 
第20行指定../bin/bin执行时的链接库为环境变量LIBRARIES的值－libm.so 
下面给出源文件
/src/main.c: 
 1.  #include&lt;stdio.h&gt;
 
2.  #include&quot;../include/a.h&quot;
 
3.  int main()
 
4.  {
 
5.  double b=25.0;
 
6.  double a=0.0;
 
7.      a=get_sqrt(b);
 
8.  
9.  </rich_text><rich_text link="webs http://www.opengroup.org/onlinepubs/009695399/functions/printf.html">printf</rich_text><rich_text>(&quot;a is %lf, b is %lf\n&quot;,a,b);
 
10.  return 0;
 
11.  }
 
12. 
 /src/a.c 
 1.  #include&quot;../include/a.h&quot;
 
2.  double get_sqrt(double var1)
 
3.  {
 
4.  return sqrt(var1);
 
5.  }
 
6. 
 /include/a.h 
#ifndef  A_FILE_HEADER_INC 
 1.  
2.  #define  A_FILE_HEADER_INC
 
3.  #include&lt;math.h&gt;
 
4.  
5.  double get_sqrt(double var1);
 
6.  
7.  #endif 

 将CMakeLists.txt放在当前目录下，执行CMakeLists.txt 
 1.  $&gt; cmake .
 
2.  $&gt; make

 即可生成可执行文件，在目录/bin下的bin文件，好了运行看其效果是否和所想一样。
</rich_text></node><node name="工具" prog_lang="custom-colors" readonly="False" tags="" unique_id="43"><rich_text>
</rich_text><node name="pahole" prog_lang="custom-colors" readonly="False" tags="" unique_id="44"><rich_text>新的git地址：git://git.kernel.org/pub/scm/devel/pahole/pahole.git
From: </rich_text><rich_text link="webs http://lwn.net/Articles/206805/">http://lwn.net/Articles/206805/</rich_text><rich_text>

Hi,

        I've been working on some DWARF2 utilities and thought that it
is about time I announce it to the community, so that what is already
available can be used by people interested in reducing structure sizes
and otherwise taking advantage of the information available in the elf
sections of files compiled with 'gcc -g' or in the case of the kernel
with CONFIG_DEBUG_INFO enabled, so here it goes the description of said
tools:

pahole: Poke-a-Hole is a tool to find out holes in structures, holes
being defined as the space between members of functions due to alignemnt
rules that could be used for new struct entries or to reorganize
existing structures to reduce its size, without more ado lets see what
that means:

[acme@newtoy net-2.6]$ pahole kernel/sched.o task_struct
/* include2/asm/system.h:11 */
struct task_struct {
        volatile long int       state;          /*     0     4 */
        struct thread_info *    thread_info;    /*     4     4 */
        atomic_t                usage;          /*     8     4 */
        long unsigned int       flags;          /*    12     4 */

        &lt;SNIP&gt;

        short unsigned int         ioprio;      /*    52     2 */

        /* XXX 2 bytes hole, try to pack */

        long unsigned int          sleep_avg;   /*    56     4 */ */
        unsigned char              fpu_counter; /*   388     1 */

        /* XXX 3 bytes hole, try to pack */

        int                        oomkilladj;  /*   392     4 */

        &lt;SNIP&gt;

}; /* size: 1312, sum members: 1287, holes: 3, sum holes: 13, padding: 12 */

        It doesn't uses any source code files, just the DWARF2
information in ELF sections, inserted by 'gcc -g', to print out the
above information, current goodies being just to show where are holes
that can be used to reduce the struct size, which is even more useful as
we transition to 64bit architectures, where such holes are more
frequent, as we can see in this example:

[acme@newtoy ~]$ file kdump.debug
kdump.debug: ELF 64-bit LSB executable, AMD x86-64, version 1 (SYSV),
dynamically linked (uses shared libs), not stripped
[acme@newtoy ~]$ pahole kdump.debug _IO_FILE | head -7
/* /usr/include/stdio.h:46 */
struct _IO_FILE {
        int   _flags;               /*     0     4 */

        /* XXX 4 bytes hole, try to pack */

        char *_IO_read_ptr;         /*     8     8 */
[acme@newtoy ~]$


        The columns in the comments are (offset, sizeof(member).

        Tons more information is available in the DWARF2 ELF sections,
making it possible to use it for other purposes, and thats where the
next dwarf comes in, pfunct:

[acme@newtoy net-2.6]$ pfunct net/ipv4/tcp_ipv4.o tcp_v4_rcv
/* /pub/scm/linux/kernel/git/acme/net-2.6/net/ipv4/tcp_ipv4.c:1054 */
int tcp_v4_rcv(struct sk_buff * skb);
/* size: 2175 */

        pfunct uses the DWARF2 information to get function details, such
as its full prototype and function size, that allows us to do some more
interesting queries, such as:

[acme@newtoy net-2.6]$ pfunct --size net/ipv4/netfilter/ip_conntrack.ko
| sort -k 2 -nr | head -10
tcp_packet: 3349
ip_conntrack_in: 1146
icmp_error: 874
ip_conntrack_expect_related: 804
__ip_conntrack_confirm: 586
tcp_new: 527
ip_conntrack_init: 525
tcp_error: 508
ip_conntrack_helper_unregister: 482
ip_conntrack_alloc: 469
[acme@newtoy net-2.6]$

